# Fonts
cask "font-jetbrains-mono"
cask "font-new-computer-modern"

# Utils
brew "wget"
brew "libzip"
brew "duti"
brew "shpotify"
brew "openconnect"
brew "vpn-slice"
brew "nmap"
cask "tailscale"
cask "wireguard"
brew "mas"
brew "ffmpeg"

# Dev
brew "rustup"
brew "openjdk@21"
brew "cmake"
brew "python@3.13"
brew "pipx"
brew "mysql-client"
brew "mysql-connector-c++"
brew "helm"
brew "php", restart_service: true
brew "composer"
brew "node"
brew "texlive"

# Apps
## Bureautique
cask "arc"
cask "beeper"
cask "busycal"
cask "discord"
cask "iina"
cask "libreoffice"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "obsidian"
cask "spotify"
cask "sublime-text"
cask "firefox"
cask "notion"
## Dev
cask "docker"
cask "jetbrains-toolbox"
cask "lens"
cask "lm-studio"
cask "termius"
cask "visual-studio-code"
cask "postman"
## Traitement
cask "figma"
cask "inkscape"
cask "qflipper"
cask "zoom"
cask "audacity"
cask "blender"
cask "handbrake"
cask "vmware-horizon-client"
cask "windows-app"
## Utils
cask "aldente"
cask "bitwarden"
cask "karabiner-elements"
cask "maccy"
cask "numi"
cask "mathpix-snipping-tool"
cask "monitorcontrol"
cask "cyberduck"
cask "mountain-duck"
cask "nextcloud"
cask "parallels-toolbox"
cask "phoenix"
cask "rectangle"
cask "free-ruler"
cask "the-unarchiver"
# cask "dimentium/autoraise/autoraiseapp"
# brew "lihaoyun6/tap/logoer"
